root@debian:/home/todd/gns3# python3 telnet_py3.py 
Enter host IPs u want to connect to seperate using a space : 192.168.10.1 192.168.10.2 192.168.10.3
Enter cmd seperate with a ',' : show ip int brief, show ip ospf nei
Username: cisco
Password: 

R1#term length 0
R1#show ip int brief
Interface              IP-Address      OK? Method Status                Protocol
FastEthernet0/0        192.168.10.1    YES manual up                    up      
FastEthernet1/0        unassigned      YES unset  up                    up      
FastEthernet1/1        unassigned      YES unset  administratively down down    
Serial2/0              unassigned      YES unset  administratively down down    
Serial2/1              unassigned      YES unset  administratively down down    
Serial2/2              unassigned      YES unset  administratively down down    
Serial2/3              unassigned      YES unset  administratively down down    
R1# show ip ospf nei

Neighbor ID     Pri   State           Dead Time   Address         Interface
192.168.10.2      1   FULL/BDR        00:00:36    192.168.10.2    FastEthernet0/0
192.168.10.3      1   FULL/DR         00:00:30    192.168.10.3    FastEthernet0/0
R1#exit


R2#term length 0
R2#show ip int brief
Interface              IP-Address      OK? Method Status                Protocol
FastEthernet0/0        192.168.10.2    YES manual up                    up      
FastEthernet1/0        unassigned      YES unset  up                    up      
FastEthernet1/1        unassigned      YES unset  administratively down down    
Serial2/0              unassigned      YES unset  administratively down down    
Serial2/1              unassigned      YES unset  administratively down down    
Serial2/2              unassigned      YES unset  administratively down down    
Serial2/3              unassigned      YES unset  administratively down down    
R2# show ip ospf nei

Neighbor ID     Pri   State           Dead Time   Address         Interface
192.168.10.1      1   FULL/DROTHER    00:00:39    192.168.10.1    FastEthernet0/0
192.168.10.3      1   FULL/DR         00:00:30    192.168.10.3    FastEthernet0/0
R2#exit


R3#term length 0
R3#show ip int brief
Interface              IP-Address      OK? Method Status                Protocol
FastEthernet0/0        192.168.10.3    YES manual up                    up      
FastEthernet1/0        unassigned      YES unset  up                    up      
FastEthernet1/1        unassigned      YES unset  administratively down down    
Serial2/0              unassigned      YES unset  administratively down down    
Serial2/1              unassigned      YES unset  administratively down down    
Serial2/2              unassigned      YES unset  administratively down down    
Serial2/3              unassigned      YES unset  administratively down down    
R3# show ip ospf nei

Neighbor ID     Pri   State           Dead Time   Address         Interface
192.168.10.1      1   FULL/DROTHER    00:00:38    192.168.10.1    FastEthernet0/0
192.168.10.2      1   FULL/BDR        00:00:35    192.168.10.2    FastEthernet0/0
R3#exit

